<?php

return [

    /*
    |--------------------------------------------------------------------------
    | PDO匹配模式
    |--------------------------------------------------------------------------
    |
    | QP暂不提供Phalcon的DB封装，因此，此配置暂时没用
    |
    | 'fetch' => int
    |    PDO返回的PHP数据结构
    |
    */
    'fetch' => PDO::FETCH_OBJ,

    /*
    |--------------------------------------------------------------------------
    | 默认的数据库连接配置，连接名为'db'
    |--------------------------------------------------------------------------
    |
    | Model中默认的连接库，可以使用DB::connection('db');获得数据库连接对象
    |
    | 'default' => array
    |   driver      : 数据库类型
    |   host        : 主机URL
    |   username    : 用户
    |   password    : 密码
    |   dbname      : 库名
    |   charset     : 字符集
    |
    */
    'default' => [
        "driver"    => "mysql",
        "host"      => "127.0.0.1",
        "username"  => "root",
        "password"  => "",
        "dbname"    => "db_name",
        "charset"   => "utf8",
    ],

    /*
    |--------------------------------------------------------------------------
    | 其他数据库连接
    |--------------------------------------------------------------------------
    |
    | 'connection' => array
    | 其中key作为连接名，value如下：
    |   driver      : 数据库类型
    |   host        : 主机URL
    |   username    : 用户
    |   password    : 密码
    |   dbname      : 库名
    |   charset     : 字符集
    |
    */
    'connection' => [

    ],

    /*
    |--------------------------------------------------------------------------
    | Redis数据库连接
    |--------------------------------------------------------------------------
    |
    | 'redis' => array
    | 其中key作为Redis的连接名，不能和上述数据库的连接名有冲突，value如下：
    |   host        : 主机URL
    |   port        : 端口号
    |   auth        : 密码(没有密码请设置为空字符串)
    |   database    : 库号
    |   prefix      : 前缀，你需要了解稍微令人费解的QP前缀设计：
    |           Phalcon默认都是以'_PHCR'作为前缀，而QP为了键名的美观，智能的在'_PHCR'后面
    |       加了一个下划线！在用户自定义前缀后加了冒号！
    |           所以，假设这里设置的prefix为'QP'，然后使用Redis::save("name")方法保存
    |       数据，此时，保存在Redis数据库中的完整key是：'_PHCR_QP:name'
    |           如果这里设置的prefix为空字符串，那么同样的保存一个key为'name'的键名，在
    |       Redis数据库中完整的eky将是：'_PHCR:name'
    |
    | 如果session驱动方式为redis的话
    |   第一个redis配置将被session使用，因此要自动以前缀的话，请在第一个配置中作文章
    |
    */
    'redis' => [
        'redis' => [
            'host' => "127.0.0.1",
            'port' => 6379,
            'auth' => '',
            'database' => 0,
            'prefix' => ''
        ],
    ],
];
