<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 是否开启Session功能
    |--------------------------------------------------------------------------
    |
    | 'open' => bool
    |    true表示开启Session功能，false表示关闭Session功能
    |
    */
    'open' => true,

    /*
    |--------------------------------------------------------------------------
    | Session驱动方式
    |--------------------------------------------------------------------------
    |
    | QP暂时支持的Session的驱动方式有file、redis两种，建议使用redis驱动
    |
    | 'driver' => string
    |    file   : 文件方式，Phalcon使用原生PHP方式处理会话，大家都知道，原生PHP确实设计
    |               的不好，因此我们建议使用'redis'驱动，保证业务逻辑的正确性
    |    redis  : Redis方式，连接设置请到：~/database.php -> redis 配置项中设置
    |               框架将会使用您配置的第一个Redis连接
    |
    */
    'driver' => 'redis',

    /*
    |--------------------------------------------------------------------------
    | Session过期时间
    |--------------------------------------------------------------------------
    |
    | 会话的过期时间，
    |
    | 'lifetime' => int
    |       会话过期时间，单位分钟。0表示永久不过期
    |
    */
    'lifetime' => 30,
];
